# 3. 판다스 데이터프레임과 시리즈

In [1]:
import pandas as pd

# 03-1 나만의 데이터 만들기

## 시리즈 생성하기

In [2]:
s = pd.Series(['banana', 42])
s

0    banana
1        42
dtype: object

In [3]:
idx = ['과일', '개수']
pd.Series(['banana', 42], index=idx)

과일    banana
개수        42
dtype: object

## 데이터프레임 생성하기

In [5]:
df = pd.DataFrame({
    '과자' : ['말차 프레첼', '우도땅콩', '초코칩']
    ,'개수' : [30, 15, 12]
    ,'칼로리' : [330, 280, 420]
})
df

       과자  개수  칼로리
0  말차 프레첼  30  330
1    우도땅콩  15  280
2     초코칩  12  420

In [7]:
df = pd.DataFrame(
    data={
        '과자' : ['말차 프레첼', '우도땅콩', '초코칩']
        ,'개수' : [30, 15, 12]
        ,'칼로리' : [330, 280, 420]
    }
    ,index=['first', 'second', 'third']
    ,columns=['과자', '칼로리', '개수']
)
df

            과자  칼로리  개수
first   말차 프레첼  330  30
second    우도땅콩  280  15
third      초코칩  420  12

▶ 딕셔너리는 기본적으로 순서를 보장하지 않기 때문에 columns에 지정한 순서대로 출력됨

In [9]:
#순서가 보장된 딕셔너리를 전달하려면 OrderedDict 사용

from collections import OrderedDict

ordDict = pd.DataFrame(OrderedDict([
    ('과자', ['말차 프레첼', '우도땅콩', '초코칩'])
    ,('개수', [30, 15, 12])
    ,('칼로리', [330, 280, 420])
]))
ordDict

       과자  개수  칼로리
0  말차 프레첼  30  330
1    우도땅콩  15  280
2     초코칩  12  420

# 03-2 시리즈 다루기 (기초)

In [17]:
#인덱스를 통해 시리즈 선택

fst_row = df.loc['first']
print(type(fst_row))
print(fst_row)

<class 'pandas.core.series.Series'>
과자     말차 프레첼
칼로리       330
개수         30
Name: first, dtype: object

In [18]:
fst_row.index

Index(['과자', '칼로리', '개수'], dtype='object')

In [19]:
fst_row.values

array(['말차 프레첼', 330, 30], dtype=object)

In [20]:
fst_row.keys()

Index(['과자', '칼로리', '개수'], dtype='object')

In [21]:
fst_row.index[1]

'칼로리'

In [22]:
fst_row.keys()[0]

'과자'

In [23]:
kcal = df['칼로리']
kcal

first     330
second    280
third     420
Name: 칼로리, dtype: int64

In [24]:
kcal.mean()

343.3333333333333

In [25]:
kcal.sum()

1030

In [26]:
kcal.max()

420

In [27]:
kcal.min()

280

In [28]:
kcal.std() #표준편차

70.94598884597588

In [29]:
kcal.equals(500) #해당 값 포함 여부

False

In [40]:
kcal.drop_duplicates() #중복값이 없는 시리즈 반환

first     330
second    280
third     420
Name: 칼로리, dtype: int64

In [41]:
kcal.describe() #요약 통계량 계산

count      3.000000
mean     343.333333
std       70.945989
min      280.000000
25%      305.000000
50%      330.000000
75%      375.000000
max      420.000000
Name: 칼로리, dtype: float64

In [38]:
kcal.sample() #시리즈의 임의의 값 반환

second    280
Name: 칼로리, dtype: int64

In [39]:
kcal.to_frame() #시리즈를 데이터프레임으로 변환

        칼로리
first   330
second  280
third   420

In [42]:
kcal.sort_values() #값 정렬

second    280
first     330
third     420
Name: 칼로리, dtype: int64

In [43]:
kcal.replace(420, 400) #값 대체

first     330
second    280
third     400
Name: 칼로리, dtype: int64

# 03-3 시리즈 다루기 (응용)

### 불린 추출 : 조건에 맞는 데이터만 추출하기

In [44]:
scientists = pd.read_csv('./data/scientists.csv')

In [50]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [47]:
ages = scientists['Age']
age_max = ages.max()
age_min =  ages.min()
age_mean = ages.mean()
print('max : ', age_max, ', min : ', age_min, ', mean : ', age_mean)

max :  90 , min :  37 , mean :  59.125

In [49]:
#평균 나이보다 나이가 많은 사람의 나이 데이터 추출하기

ages[ages > age_mean]

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

### 브로드캐스팅 : 시리즈나 데이터프레임에 있는 모든 데이터를 한번에 연산하는 것
- 벡터 : 시리즈처럼 여러 개의 값을 가진 데이터
- 스칼라 : 단순 크기를 나타내는 데이터

In [51]:
#같은 길이의 벡터로 연산 수행하기

ages + ages

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [53]:
#같은 길이의 벡터로 연산 수행하기

ages * ages

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [54]:
#벡터와 스칼라 연산

ages + 100

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [55]:
ages * 2

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [57]:
import numpy as np

In [58]:
#길이가 서로 다른 벡터 연산
#같은 인덱스의 값만 계산

s2 = pd.Series([1, np.nan, 100])
ages + s2

0     38.0
1      NaN
2    190.0
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [59]:
ages.sort_index(ascending=False) #인덱스 역순으로 정렬

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

# 03-4 데이터 프레임 다루기

### 불린 추출 : 조건에 맞는 데이터만 추출하기

In [60]:
scientists

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [65]:
#Age열에서 평균 Age 보다 높은 경우의 데이터 행만 출력하기

condi = scientists['Age'] > scientists['Age'].mean()
print(condi)
scientists[condi]

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [66]:
bool_idx = [True, True, False, True, True, True, False, True]
scientists[bool_idx]

                Name        Born        Died  Age     Occupation
0  Rosaline Franklin  1920-07-25  1958-04-16   37        Chemist
1     William Gosset  1876-06-13  1937-10-16   61   Statistician
3        Marie Curie  1867-11-07  1934-07-04   66        Chemist
4      Rachel Carson  1907-05-27  1964-04-14   56      Biologist
5          John Snow  1813-03-15  1858-06-16   45      Physician
7       Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [67]:
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

# 03-5 시리즈와 데이터프레임의 데이터 처리하기

### 열의 자료형 바꾸기

In [70]:
#Born과 Died 컬럼의 데이터는 날짜 데이터이므로 datetime 자료형으로 바꾸는 것이 더 좋음

print(scientists['Born'].dtype)

print(scientists['Died'].dtype)

object
object

In [72]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d')
print(born_datetime)

died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]
0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [73]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)

In [74]:
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23

In [75]:
#datetime 자료형으로 변경된 날짜 데이터 계산

scientists['age_days_dt'] = (scientists['died_dt'] - scientists['born_dt'])
scientists

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,1777-04-30,1855-02-23,28422 days

### 시리즈, 데이터프레임 데이터 섞기

In [76]:
scientists['Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [77]:
import random as rd

rd.seed(42) #컴퓨터가 생성하는 난수의 기준값
rd.shuffle(scientists['Age'])

print(scientists['Age'])

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

C:\Users\serye\anaconda3\lib\random.py:394: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

### 데이터프레임 열 삭제

In [78]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

In [79]:
scientists_drop_age = scientists.drop(['Age'], axis=1)
scientists_drop_age.columns

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt'],
      dtype='object')

# 03-6 데이터 저장하고 불러오기

### 피클 저장
---
#### 피클 : 데이터를 바이너리 형태로 직렬화한 오브젝트를 저장하는 방법
- 스프레드시트 보다 더 작은 용량으로 데이터 저장이 가능하여 매우 편리

In [83]:
#시리즈 피클로 저장

names = scientists['Name']
names.to_pickle('./output/scientists_series.pickle')

In [84]:
#데이터프레임 피클로 저장

scientists.to_pickle('./output/scientists_df.pickle')

In [86]:
pd.read_pickle('./output/scientists_series.pickle')

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [87]:
pd.read_pickle('./output/scientists_df.pickle')

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt
0,Rosaline Franklin,1920-07-25,1958-04-16,66,Chemist,1920-07-25,1958-04-16,13779 days
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13,32964 days
3,Marie Curie,1867-11-07,1934-07-04,77,Chemist,1867-11-07,1934-07-04,24345 days
4,Rachel Carson,1907-05-27,1964-04-14,90,Biologist,1907-05-27,1964-04-14,20777 days
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07,15324 days
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23,28422 days

### CSV / TSV 저장
---
#### CSV : 데이터를 쉼표로 구분하여 저장한 파일
#### TSV : 데이터를 탭으로 구분하여 저장한 파일

In [88]:
names.to_csv('./output/scientist_name_series.csv')

In [90]:
scientists.to_csv('./output/scientist_df.csv')

In [92]:
scientists.to_csv('./output/scientist_df.tsv', sep='\t')

### 엑셀 파일 저장
---
#### 시리즈는 엑셀 구조와 맞지 않기 때문에 불가능. 데이터프레임으로 변환해야 함

In [93]:
pip install xlwt

Collecting xlwt
  Downloading xlwt-1.3.0-py2.py3-none-any.whl (99 kB)
     -------------------------------------- 100.0/100.0 kB 5.6 MB/s eta 0:00:00
Installing collected packages: xlwt
Successfully installed xlwt-1.3.0
Note: you may need to restart the kernel to use updated packages.

In [94]:
pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\serye\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\serye\anaconda3\lib\site-packages (from openpyxl) (1.1.0)
Note: you may need to restart the kernel to use updated packages.

In [95]:
names_df = names.to_frame()

names_df.to_excel('./output/scientist_name_series_df.xls')

C:\Users\serye\AppData\Local\Temp\ipykernel_31716\3932124416.py:3: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  names_df.to_excel('./output/scientist_name_series_df.xls')

In [96]:
names_df.to_excel('./output/scientist_name_series_df.xlsx')